 # Data understanding and Preparation  
Please try to complete the following steps mentioned in this notebook. You must use the following datasets"
1. [Transaction Data Set](https://docs.google.com/spreadsheets/d/1ypBwn11Dx1jgkJ31QPEUhHH8KS1x4p93iEDczLRphKc/edit#gid=10930346)
2.  [Product Data Set](https://docs.google.com/spreadsheets/d/18KvUOxJWXD6IZdOxmIxudEpbZSTkwDkZmVthNYiL8Qw/edit#gid=2133147773)
3.  [Customer Data Set ](https://docs.google.com/spreadsheets/d/1wx8vT5_oSJq6-cY3g5YPNEO47fE3jzcudtqIwjXYi1c/edit#gid=110025385)

In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt

## Question 1
combine transactions_data with product_data

**Import the Data**

In [3]:
trans_df = pd.read_csv('transaction.csv')
prod_df = pd.read_csv('product.csv')
cust_df = pd.read_csv('customer.csv')

In [4]:
prod_df.head()

   PRODUCT CODE PRODUCT CATEGORY UNIT LIST PRICE
0         30001  HEALTH & BEAUTY           $7.45
1         30002  HEALTH & BEAUTY           $5.35
2         30003  HEALTH & BEAUTY           $5.49
3         30004  HEALTH & BEAUTY           $6.46
4         30005  HEALTH & BEAUTY           $7.33

In [5]:
trans_df.head()

,CUSTOMER NUM,PRODUCT NUM,QUANTITY PURCHASED,DISCOUNT TAKEN,TRANSACTION DATE,STOCKOUT
0,10114,30011,4.0,0.0,1/2/2015,0.0
1,10217,30016,3.0,0.0,1/3/2015,0.0
2,10224,30013,4.0,0.2,1/4/2015,0.0
3,10103,30012,3.0,0.0,1/5/2015,0.0
4,10037,30010,8.0,0.0,1/6/2015,0.0

In [44]:
cust_df.head()

,CUSTOMERID,GENDER,AGE,INCOME,EXPERIENCE SCORE,LOYALTY GROUP,ENROLLMENT DATE,HOUSEHOLD SIZE,MARITAL STATUS,TOTAL SPENT,TOTAL APPAREL,TOTAL ELECTRONICS,LAST TRANSACTION
0,10001,0,64,"$133,498",5,enrolled,06-03-2013,4,Single,None,None,None,None
1,10002,0,42,"$94,475",9,notenrolled,NaN,6,Married,None,None,None,None
2,10003,0,40,"$88,610",9,enrolled,02-09-2010,5,Married,None,None,None,None
3,10004,0,38,"$84,313",8,enrolled,06-04-2015,1,Single,None,None,None,None
4,10005,0,30,"$51,498",3,notenrolled,NaN,1,Single,None,None,None,None

In [51]:
#function to match products to their respective codes in transactions
def match_():
    prod_cat_list = []
    price_list = []
    for i in range(len(trans_df)):
        for x in range(len(prod_df)):
            if trans_df['PRODUCT NUM'][i] == prod_df['PRODUCT CODE'][x]:
                prod_cat_list.append(prod_df['PRODUCT CATEGORY'][x])
                price_list.append(prod_df['UNIT LIST PRICE'][x])
    return prod_cat_list, price_list

In [62]:
#function to combine transactions with products
def combine_(): 
    #combine variable name for Products and Transactions
    data_PT = trans_df
    data_PT['PRODUCT CATEGORY'], data_PT['UNIT PRICE'] = match_()
    #We arrange the table to be intuitevily easy to percieive and understand for the common user.
    return data_PT

In [63]:
data_PT = combine_()
data_PT.head()

,CUSTOMER NUM,PRODUCT NUM,QUANTITY PURCHASED,DISCOUNT TAKEN,TRANSACTION DATE,STOCKOUT,PRODUCT CATEGORY,UNIT PRICE
0,10114,30011,4.0,0.0,1/2/2015,0.0,APPAREL,$25.46
1,10217,30016,3.0,0.0,1/3/2015,0.0,APPAREL,$29.31
2,10224,30013,4.0,0.2,1/4/2015,0.0,APPAREL,$26.85
3,10103,30012,3.0,0.0,1/5/2015,0.0,APPAREL,$28.51
4,10037,30010,8.0,0.0,1/6/2015,0.0,APPAREL,$25.27

In [64]:
data_PT['PRODUCT CATEGORY'].unique()

array(['APPAREL', 'ELECTRONICS'], dtype=object)

## Question 2
After combining both data sets For each customer , calculate total spend ,total spend per category ,recent transaction date

In [65]:
agr_cust_df = cust_df
agr_cust_df['TOTAL SPENT'] = None
for a in range(len(data_PT['PRODUCT CATEGORY'].unique())):
    agr_cust_df['TOTAL {}'.format(data_PT['PRODUCT CATEGORY'].unique()[a])] = None
agr_cust_df['LAST TRANSACTION'] = None
    
agr_cust_df['CUSTOMERID'].tolist().index(data_PT.loc[1][0])

216

In [67]:
def total_spent(self):
    for count in range(len(self)):
        if self.loc[count][1] in agr_cust_df['CUSTOMERID']:
            print('YES')
        
        
total_spent(data_PT)

## Question 3
Do Univariate Analysis

## Question 4
- Perform Bivariate Analysis (2-variable analysis) where Loyalty is a target variable
-  Perform Bivariate Analysis (2-variable analysis) where Customer spend is a target variable

## Question 5
Group combined dataset by Loyalty group and aggregate with mean age. then plot box plot

## Question 6
Group combined dataset by EXPERIENCE SCORE and aggregate with mean TOTAL SPENT and then plot bar plot